<?php

return [

    /*
    |--------------------------------------------------------------------------
    | Validation Language Lines
    |--------------------------------------------------------------------------
    |
    | تحتوي السطور التالية على رسائل الخطأ الافتراضية المستخدمة من قبل
    | فئة المحقق. بعض هذه القواعد لها إصدارات متعددة مثل قواعد الحجم.
    | لا تتردد في تعديل كل هذه الرسائل هنا.
    |
    */

    'accepted' => 'يجب قبول :attribute.',
    'accepted_if' => 'يجب قبول :attribute عندما :other تكون :value.',
    'active_url' => ':attribute ليس رابطًا صحيحًا.',
    'after' => ':attribute يجب أن يكون تاريخًا بعد :date.',
    'after_or_equal' => ':attribute يجب أن يكون تاريخًا بعد أو يساوي :date.',
    'alpha' => ':attribute يجب أن يحتوي فقط على حروف.',
    'alpha_dash' => ':attribute يجب أن يحتوي فقط على حروف، أرقام، وشرطات وتراشيح.',
    'alpha_num' => ':attribute يجب أن يحتوي فقط على حروف وأرقام.',
    'array' => ':attribute يجب أن يكون مصفوفة.',
    'before' => ':attribute يجب أن يكون تاريخًا قبل :date.',
    'before_or_equal' => ':attribute يجب أن يكون تاريخًا قبل أو يساوي :date.',
    'between' => [
        'array' => ':attribute يجب أن يحتوي بين :min و :max عنصرًا.',
        'file' => ':attribute يجب أن يكون بين :min و :max كيلوبايت.',
        'numeric' => ':attribute يجب أن يكون بين :min و :max.',
        'string' => ':attribute يجب أن يكون بين :min و :max حرفًا.',
    ],
    'boolean' => 'يجب أن يكون حقل :attribute صحيحًا أو خطأ.',
    'confirmed' => 'تأكيد :attribute لا يتطابق.',
    // ... وهكذا تتابع القواعد الباقية
    // ...

    /*
    |--------------------------------------------------------------------------
    | Custom Validation Language Lines
    |--------------------------------------------------------------------------
    |
    | هنا يمكنك تحديد رسائل التحقق المخصصة للسمات باستخدام
    | النمط "attribute.rule" لتسمية الخطوط. وهذا يجعل من السهل
    | تحديد رسالة لغة مخصصة محددة لقاعدة معينة للسمة المعطاة.
    |
    */

    'custom' => [
        'attribute-name' => [
            'rule-name' => 'custom-message',
        ],
    ],

    /*
    |--------------------------------------------------------------------------
    | Custom Validation Attributes
    |--------------------------------------------------------------------------
    |
    | يتم استخدام السطور التالية لاستبدال مكان حامل السمة
    | بشيء أكثر ودية للقارئ مثل "عنوان البريد الإلكتروني" بدلاً من "email".
    | هذا يساعد ببساطة في جعل الرسالة أكثر تعبيرية.
    |
    */

    'attributes' => [],

];
